app/Controllers/Admins/AdminsController.php

    public function checkLogin()
    {


        $session = session();
        $adminModel = new Admin();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $adminModel->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'admin.second@gmail.com'
 LIMIT 1

    public function index()
    {

        $session = session();

        $numPosts = $this->db->table('posts')->countAllResults();
        $numCategories = $this->db->table('categories')->countAllResults();
        $numAdmins = $this->db->table('admins')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `posts`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `admins`

    public function allAdmins() {

        $session = session();


        $admins = new Admin();

        $allAdmins = $admins->select('*')->orderBy('id', 'DESC')
         ->get()
         ->getResult();
---
SELECT *
FROM `admins`
ORDER BY `id` DESC

    public function allCategories() {

        $session = session();


        $categories = new Category();

        $allCategories = $categories->select('*')->orderBy('id', 'DESC')
         ->get()
         ->getResult();
---
SELECT *
FROM `categories`
ORDER BY `id` DESC

    public function allPosts() {

        $session = session();


        $posts = new Post();

        $allPosts = $posts->select('*')->orderBy('id', 'DESC')
         ->get()
         ->getResult();
---
SELECT *
FROM `posts`
ORDER BY `id` DESC