app/Controllers/Home.php

SELECT *
FROM `posts`
 LIMIT 2
SELECT *
FROM `posts`
 LIMIT 1
SELECT *
FROM `posts`
ORDER BY `id` DESC
 LIMIT 2
SELECT *
FROM `posts`
WHERE `category` = 'business'
ORDER BY `id` DESC
 LIMIT 2
SELECT *
FROM `posts`
WHERE `category` = 'business'
ORDER BY `title` DESC
 LIMIT 3
SELECT *
FROM `posts`
ORDER BY `id` DESC
 LIMIT 3
SELECT *
FROM `posts`
WHERE `category` = 'culture'
ORDER BY `id` DESC
 LIMIT 2
---
    public function index(): string
    {

        $posts = new Post();

       // $data['posts'] = $posts->findAll();

        $data = $posts->select('*')->get(2)->getResult();

        $data1 = $posts->select('*')->get(1)->getResult();

        $dataTwoPosts = $posts->select('*')->orderBy('id', 'DESC')->get(2)->getResult();


        //BUSINESS section

        $businessTwoPosts = $posts->select('*')->where('category', 'business')
         ->orderBy('id', 'DESC')->get(2)->getResult();

        $businessThreePosts = $posts->select('*')->where('category', 'business')
         ->orderBy('title', 'DESC')->get(3)->getResult();

        $dataFourPosts = $posts->select('*')->orderBy('id', 'DESC')->get(3)->getResult();


        //culture section

        $cultureTwoPosts = $posts->select('*')->where('category', 'culture')
         ->orderBy('id', 'DESC')->get(2)->getResult();